; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v6 ?v1)
             (pred_1 ?v11 ?v9)
             (pred_12 ?v6 ?v9)
             (pred_4 ?v12 ?v6 )
	     (pred_10 ?v6)
             (pred_7 ?v4)
             (pred_8 ?v11)
             (pred_11 ?v9)
             (pred_5 ?v6)
             (pred_9 ?v11)
             (pred_2 ?v6)
             (pred_6 ))



(:action op_2
:parameters (?v8 ?v5 ?v3 ?v13)
:precondition (and (pred_7 ?v8) (pred_7 ?v5) (pred_8 ?v3) (pred_11 ?v13)
          (pred_3 ?v8 ?v5) (pred_1 ?v3 ?v13)
                   (pred_12 ?v5 ?v13) (pred_10 ?v8) 
                   (pred_5 ?v5) (pred_9 ?v3))
:effect (and  (pred_2 ?v5) (not (pred_5 ?v5))))


(:action op_1
:parameters (?v8 ?v7)
:precondition (and (pred_7 ?v8) (pred_7 ?v7)
               (pred_10 ?v8) (pred_3 ?v8 ?v7) (pred_2 ?v7))
:effect (and (pred_10 ?v7) (not (pred_10 ?v8))))

(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_7 ?v8) (pred_8 ?v3) 
                  (pred_10 ?v8) (pred_4 ?v3 ?v8) (pred_6 ))
:effect (and (pred_9 ?v3)
   (not (pred_4 ?v3 ?v8)) (not (pred_6 ))))


(:action op_3
:parameters (?v8 ?v10 ?v2)
:precondition (and (pred_7 ?v8) (pred_8 ?v10) (pred_8 ?v2)
                  (pred_10 ?v8) (pred_9 ?v2) (pred_4 ?v10 ?v8))
:effect (and (pred_9 ?v10) (pred_4 ?v2 ?v8)
        (not (pred_9 ?v2)) (not (pred_4 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v3)
:precondition (and (pred_7 ?v8) (pred_8 ?v3) 
                  (pred_10 ?v8) (pred_9 ?v3))
:effect (and (pred_6 ) (pred_4 ?v3 ?v8) (not (pred_9 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_22 obj_14 obj_10 obj_27 obj_12 obj_05 obj_21 obj_30 obj_31 obj_23 obj_04 obj_28 obj_15 obj_13 obj_01 obj_07 obj_03 obj_09 obj_06 obj_32 obj_16 obj_11 obj_25 obj_24 obj_26
    obj_20 obj_17 obj_08
    obj_29 obj_19 obj_02 obj_18
    )

    (:init
       (pred_6)

       (pred_7 obj_22)
       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_27)
       (pred_7 obj_12)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_30)
       (pred_7 obj_31)
       (pred_7 obj_23)
       (pred_7 obj_04)
       (pred_7 obj_28)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_01)
       (pred_7 obj_07)
       (pred_7 obj_03)
       (pred_7 obj_09)
       (pred_7 obj_06)
       (pred_7 obj_32)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_24)
       (pred_7 obj_26)
       (pred_11 obj_20)
       (pred_11 obj_17)
       (pred_11 obj_08)
       (pred_8 obj_29)
       (pred_8 obj_19)
       (pred_8 obj_02)
       (pred_8 obj_18)

       (pred_3 obj_22 obj_05)
       (pred_3 obj_22 obj_14)
       (pred_3 obj_14 obj_21)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_14 obj_22)
       (pred_3 obj_10 obj_30)
       (pred_3 obj_10 obj_27)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_27 obj_31)
       (pred_3 obj_27 obj_12)
       (pred_3 obj_27 obj_10)
       (pred_3 obj_12 obj_23)
       (pred_3 obj_12 obj_27)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_21)
       (pred_3 obj_05 obj_22)
       (pred_3 obj_21 obj_28)
       (pred_3 obj_21 obj_30)
       (pred_3 obj_21 obj_14)
       (pred_3 obj_21 obj_05)
       (pred_3 obj_30 obj_15)
       (pred_3 obj_30 obj_31)
       (pred_3 obj_30 obj_10)
       (pred_3 obj_30 obj_21)
       (pred_3 obj_31 obj_13)
       (pred_3 obj_31 obj_23)
       (pred_3 obj_31 obj_27)
       (pred_3 obj_31 obj_30)
       (pred_3 obj_23 obj_01)
       (pred_3 obj_23 obj_12)
       (pred_3 obj_23 obj_31)
       (pred_3 obj_04 obj_07)
       (pred_3 obj_04 obj_28)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_28 obj_03)
       (pred_3 obj_28 obj_15)
       (pred_3 obj_28 obj_21)
       (pred_3 obj_28 obj_04)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_15 obj_30)
       (pred_3 obj_15 obj_28)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_31)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_01 obj_32)
       (pred_3 obj_01 obj_23)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_07 obj_16)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_07 obj_04)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_03 obj_09)
       (pred_3 obj_03 obj_28)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_09 obj_25)
       (pred_3 obj_09 obj_06)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_03)
       (pred_3 obj_06 obj_24)
       (pred_3 obj_06 obj_32)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_06 obj_09)
       (pred_3 obj_32 obj_26)
       (pred_3 obj_32 obj_01)
       (pred_3 obj_32 obj_06)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_07)
       (pred_3 obj_11 obj_25)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_25 obj_24)
       (pred_3 obj_25 obj_09)
       (pred_3 obj_25 obj_11)
       (pred_3 obj_24 obj_26)
       (pred_3 obj_24 obj_06)
       (pred_3 obj_24 obj_25)
       (pred_3 obj_26 obj_32)
       (pred_3 obj_26 obj_24)
       (pred_5 obj_13)
       (pred_5 obj_31)
       (pred_5 obj_07)
       (pred_5 obj_01)
       (pred_12  obj_13 obj_20)
       (pred_12  obj_31 obj_17)
       (pred_12  obj_07 obj_08)
       (pred_12  obj_01 obj_17)
       (pred_2 obj_22)
       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_2 obj_27)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_21)
       (pred_2 obj_30)
       (pred_2 obj_23)
       (pred_2 obj_04)
       (pred_2 obj_28)
       (pred_2 obj_15)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_32)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_2 obj_25)
       (pred_2 obj_24)
       (pred_2 obj_26)

       (pred_1  obj_29 obj_20)
       (pred_1  obj_19 obj_17)
       (pred_1  obj_02 obj_08)
       (pred_1  obj_18 obj_08)
       (pred_4 obj_29 obj_16)
       (pred_4 obj_19 obj_26)
       (pred_4 obj_02 obj_27)
       (pred_4 obj_18 obj_32)
       (pred_10 obj_25)
    )

    (:goal (and
       (pred_4 obj_18 obj_03)
    ))
(:constraints
  (always (not (pred_10 obj_06)))
)
)

; plan
1. (op_1 obj_25 obj_24)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_24)
   goals met: 0 of 1
2. (op_1 obj_24 obj_26)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_26)
   goals met: 0 of 1
3. (op_1 obj_26 obj_32)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_32)
   goals met: 0 of 1
4. (op_5 obj_32 obj_18)
   deleted: (pred_4 obj_18 obj_32) (pred_6)
   added: (pred_9 obj_18)
   goals met: 0 of 1
5. (op_1 obj_32 obj_26)
   deleted: (pred_10 obj_32)
   added: (pred_10 obj_26)
   goals met: 0 of 1
6. (op_1 obj_26 obj_24)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_24)
   goals met: 0 of 1
7. (op_1 obj_24 obj_25)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_25)
   goals met: 0 of 1
8. (op_1 obj_25 obj_09)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_09)
   goals met: 0 of 1
9. (op_1 obj_09 obj_03)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_03)
   goals met: 0 of 1
10. (op_4 obj_03 obj_18)
   deleted: (pred_9 obj_18)
   added: (pred_6) (pred_4 obj_18 obj_03)
   goals met: 1 of 1
